#include <stdio.h>
#include <math.h>


int kroky(int x, int y) {
    int d=y-x; // Обчислюємо відстань, яку необхідно подолати
    int k=(int) sqrt(2*d); // Знаходимо максимальну кількість кроків, яку можна зробити
    int suma_krokiv=k*(k+1)/2; // Знаходимо суму арифметичної прогресії перших k натуральних чисел
    // Перевірка умов для знаходження мінімальної кількості кроків
    if (suma_krokiv>=d&&(suma_krokiv-d)%2==0) return k; // Повертаємо кількість кроків k
    else if (suma_krokiv+k+1>=d&&(suma_krokiv+k+1-d)%2==0) return k+1; // Повертаємо кількість кроків k з додатковим кроком
    else return k+2;} // Повертаємо кількість кроків k з двома додатковими кроками

int main() {
    int x, y;
    printf("Введіть значення x та y: ");
    scanf("%d %d", &x, &y);
    int result = kroky(x, y); // Викликаємо функцію minSteps для знаходження мінімальної кількості кроків
    printf("Мінімальна кількість кроків: %d\n", result); // Виводимо результат на екран
    return 0;
}
